--- a/README.md
+++ b/README.md
@@ -51,35 +36,29 @@ everything works fine. It will work fine. I trust it!
 
 # What it does
 
-```
-                                         ┌─────────┐
-                                         │beatsaber│
-                                         │ (quest) │
-                                         └─────▲───┘
-                                               │
-                                               │ ┌──────┐
-┌─────────┐   Bluetooth(BLE)                   │ │......│
-│POLAR H10├────────────────┐                   │ └───▲──┘
-└─────────┘                │                   │     │
-                           │                   │     │
-┌───────────┐              │   ┌─────────────┐ │     │
-│Smart watch├──────────────┼──►│Android Phone├─┴─────┤UDP Package
-└───────────┘              │   └─────────────┘       │via WLAN
-                           │                         │
-┌────────────────────────┐ │                         │
-│BLR Heartrate Devices...├─┘         YOU ARE HERE    │
-└────────────────────────┘                    │      │
-                                         ┌────▼──────▼──┐       beautiful web ui?
-                    ┌────────────────────┤webpage client├────────────────┐
-                    │http://127.0.0.1:xxx└────┬─────────┘                │
-                    │                         │HRCounter's api           │
-              ┌─────▼────────┐    ┌───────────▼───────────┐    ┌─────────▼────────┐
-              │Web browser   │    │BeatSaber HRCounter mod│    │Beautiful UI to   │
-              │to view deails│    └───────────────────────┘    │display inside OBS│
-              └──────────────┘                                 │(TODO)            │
-                                                               └──────────────────┘
-```
+```mermaid
+graph TD;
+    POLAR_H10[Polar H10]
+    SMART_WATCH[Shart watch, broadcast heartrate]
+    BLE_DEV[other BLE heartrate devs]
+    PHONE[phone. android apk]
+    BEATSABER[beatsaber quest mod]
+    PCAPP[webpage client, <b>YOU ARE HERE</b>]
+    BEATSABER_PC[Beatsaber PC game with HRCounter mod]
+    BROWSER[browser, to view config and datas]
 
+    POLAR_H10--bluetooth-->PHONE;
+    SMART_WATCH--bluetooth-->PHONE;
+    BLE_DEV--bluetooth-->PHONE;
+    PHONE--LAN-->BEATSABER;
+    PHONE--LAN-->PCAPP;
+    PHONE--LAN-->...;
+
+    PCAPP--127.0.0.1:xxxx-->BROWSER;
+    PCAPP--HRCounter protocol-->BEATSABER_PC;
+    PCAPP--a web ui(TODO)-->OBS
+
+```
 - [Android phone](https://github.com/frto027/HeartbeatLanServer/releases/latest) apk download here
 - [HRCounter](https://github.com/qe201020335/HRCounter) A fast config generator is included in this software.
 
